+++
title = "Configuraci칩n OSPF"
date = 2025-08-22
+++

#### Configuraci칩n de OSPF (Open Shortest Path First)

En esta secci칩n encontrar치s los comandos m치s importantes para **configurar, ajustar y verificar OSPF** en routers Cisco.  
Cada comando viene acompa침ado de una breve explicaci칩n para entender qu칠 hace.

```bash
R1(config)# router ospf 1
```

Inicia el proceso OSPF en el router. El `process-id` solo tiene significado local, no debe coincidir con otros routers.

```bash
R1(config-router)# network 10.0.12.0 0.0.0.3 area 0
```

Activa OSPF en una interfaz si su direcci칩n IP coincide con la red indicada, y la asocia a un 치rea.

```bash
R1(config-router)# router-id 1.1.1.1
```

Define manualmente el Router ID, valor 칰nico que identifica al router dentro del dominio OSPF.

```bash
R1(config-router)# clear ip ospf process
```

Reinicia el proceso OSPF. Necesario para aplicar cambios en el Router ID.

游늵 M칠trica (Cost)

```bash
R1(config-if)# ip ospf cost 10
```

Ajusta manualmente el costo de la interfaz (m칠trica usada para calcular rutas).

```bash
R1(config-router)# auto-cost reference-bandwidth 10000
```

Cambia el ancho de banda de referencia global (por defecto 100 Mbps). Importante en redes r치pidas (Gigabit o superiores).

游 Passive Interface

```bash
R1(config-router)# passive-interface g1/0
```

Evita que OSPF env칤e mensajes Hello por esa interfaz, pero la red a칰n ser치 anunciada en OSPF.

```bash
R1(config-router)# passive-interface default
```

Pone **todas** las interfaces en modo pasivo.

```bash
R1(config-router)# no passive-interface g0/0
```

Reactiva OSPF en una interfaz espec칤fica.

游깴 Ruta por Defecto

```bash
R1(config-router)# default-information originate
```

Redistribuye una ruta por defecto en OSPF. Convierte al router en un ASBR (Autonomous System Boundary Router).

游깷 Tipo de Red OSPF

```bash
R1(config-if)# ip ospf network {broadcast | non-broadcast | point-to-multipoint | point-to-point}
```

Define el tipo de red OSPF en una interfaz. Esto afecta c칩mo se forman los vecinos y si se eligen DR/BDR.

**Comandos sh**

```bash
R1# show ip ospf neighbor
```

游녤 Muestra los vecinos OSPF y su estado de adyacencia.

```bash
R1# show ip protocols
```

游녤 Verifica informaci칩n general de OSPF, incluyendo Router ID, timers y redes anunciadas.

```bash
R1# show ip ospf database
```

游녤 Muestra la LSDB (Link State Database), incluyendo los LSAs recibidos.

```bash
R1# show ip route ospf
```

游녤 Visualiza las rutas instaladas en la tabla de enrutamiento v칤a OSPF.




